1.1. რა მონაცემთა ტიპები ვიცით JavaScript-ში? (Primitive vs Non-Primitive)

პრიმიტიული ტიპები 7 ტიპი: string, number, boolean, undefined, null, symbol, bigInt

არაპრიმიტიული ტიპები: Object მათ შორის Array, Function, Date

1.2. რა განსხვავებაა ცვლადის გამოცხადების ტიპებს შორის: var, let და const?
constის ცვლილება არ შეგვიძლია რა მნისენლობასაც მივანიჭებთ ის იქნება ხოლაო var და letის ცვლადის მნიშვნელობის შეცვლა შეიძლება

1.3. განმარტეთ Call Stack და Memory Heap: რა განსხვავებაა მათ შორის და სად ინახება მონაცემები?

ქოლსტეკი (Call Stack) პროგრამირებაში არის მეხსიერების სპეციალური სტრუქტურა, რომელსაც კომპიუტერი იყენებს იმის დასამახსოვრებლად, 
თუ რა თანმიმდევრობით იძახებს პროგრამა ფუნქციებს ან მეთოდებს. ის მუშაობს პრინციპით — ბოლოს შემოსული პირველი გადის (LIFO - Last In, First Out).

მემორი ჰიპი (Heap)
დანიშნულება: გამოიყენება დინამიკური მეხსიერებისთვის (მონაცემები, რომელთა ზომა ან სიცოცხლის ხანგრძლივობა წინასწარ უცნობია და გრძელდება მანამ, სანამ პროგრამა მუშაობს).
მუშაობის პრინციპი: მონაცემები ინახება თავისუფლად, შემთხვევითი წვდომის პრინციპით. ჰიპზე შენახულ ობიექტებთან წვდომა ხდება სტექზე შენახული მისამართების (Pointers) მეშვეობით.
სიჩქარე: მუშაობს უფრო ნელა, ვიდრე სტექი, რადგან სისტემას სჭირდება მეხსიერების სპეციალური მენეჯერის გამოყენება თავისუფალი ადგილის მოსაძებნად და გასაკონტროლებლად.
ზომა: ზომა არის დიდი და მოქნილი. მასზე მეხსიერების ლიმიტი ძირითადად მხოლოდ ფიზიკური RAM-ის ან ვირტუალური მეხსიერების მოცულობით შემოიფარგლება.


1.4. რა არის Event Loop (მოვლენათა ციკლი) Node.js-ში და როგორ მუშაობს ის?

ივენთ ლუპი (Event Loop) არის პროგრამირების კონცეფცია, რომელიც მართავს და აკონტროლებს პროგრამის მიერ ინსტრუქციების შესრულების თანმიმდევრობას.
იგი გამუდმებით ამოწმებს, არის თუ არა რაიმე ახალი მოვლენა (ივენთი) დასამუშავებელი და საჭიროებისამებრ გადასცემს მას შესაბამის კოდს.

1.5. რა არის Promise? აღწერეთ მისი მდგომარეობები (States) და რით განსხვავდება ის Callback-ებისგან?

Promise არის სპეციალური ობიექტი, რომელიც წარმოადგენს ასინქრონული ოპერაციის საბოლოო შედეგს (წარმატებას ან მარცხს).
მარტივად რომ ვთქვათ, Promise არის „დაპირება“, რომ რაღაც მოქმედება (მაგალითად, სერვერიდან მონაცემების წამოღება)
მომავალში დასრულდება. სანამ ეს მოქმედება მიმდინარეობს, კოდი არ იბლოკება და აგრძელებს მუშაობას.

1.6. რა არის Async/Await და როგორ მუშაობს ის Promise-ების ბაზაზე?

async/await არის პროგრამირების კონსტრუქცია , რომელიც გვეხმარება ასინქრონული კოდის ისე დაწერაში,
რომ ის გამოიყურებოდეს და იკითხებოდეს როგორც მარტივი, სინქრონული კოდი

async (ასინქრონული): ფუნქციის წინ მიწერილი ეს სიტყვა კომპიუტერს ეუბნება, რომ ეს ფუნქცია ყოველთვის
აბრუნებს შედეგს დაპირების (Promise) სახით. ასინქრონული ფუნქციის შესრულება არ აფერხებს მთელი პროგრამის მუშაობას.

await (მოლოდინი): გამოიყენება მხოლოდ async ფუნქციის შიგნით. ის აჩერებს კონკრეტული ფუნქციის მუშაობას მანამ, სანამ დაპირებული პასუხი
(მაგ. მონაცემთა ბაზიდან პასუხი) არ დაბრუნდება. მთავარი უპირატესობა: ის არ აჩერებს მთელ სისტემას — სხვა ამოცანებს ამ დროს კვლავ შეუძლიათ მუშაობა.

// 1.7. რა არის Class (კლასი) JavaScript-ში და რა არის OOP-ის (ობიექტზე ორიენტირებული პროგრამირების) ძირითადი პრინციპები?
Class არის შაბლონი/ნახაზი ობიექტების შესაქმნელად.
ობიექტზე ორიენტირებული პროგრამირება (OOP) არის პროგრამირების პარადიგმა, რომელიც ეფუძნება „ობიექტების“ კონცეფციას. ობიექტი აერთიანებს მონაცემებს (თვისებებს / properties) და ქცევას (მეთოდებს / methods).

1.8 რამდენი გარემო იცით. და მათი განსხვავბეა ?  
Development,Staging,Testing

// 2.1. რა არის Request-Response?
კლიენტი (Client): მოწყობილობა ან პროგრამა (მაგალითად, შენი ვებ-ბრაუზერი), რომელიც აგზავნის მოთხოვნას (Request).

სერვერი (Server): დისტანციური კომპიუტერი/სისტემა, რომელიც იღებს ამ მოთხოვნას, ამუშავებს მას და აბრუნებს პასუხს (Response).

2.2.ჩამოთვალე რექვესთები და მათი თავისებურება განმარტე.

GET - მონაცემების წამოღება
სერვერიდან ინფორმაციის ამოღება/წაკითხვა

POST - ახალი მონაცემის შექმნა
სერვერზე ახალი რესურსის/მონაცემის გაგზავნა და შექმნა.

PUT - მონაცემის სრული განახლება/ჩანაცვლება
სერვერზე არსებული რესურსის სრული განახლება ან შექმნა (თუ არ არსებობს)

PATCH - მონაცემის ნაწილობრივი განახლება
სერვერზე არსებული რესურსის მხოლოდ ცალკეული ველების (ნაწილობრივი) განახლება.

DELETE - მონაცემის წაშლა
სერვერიდან კონკრეტული რესურსის წაშლა.

2.3. რა განსხვავებაა URL Params-ს, Query Params-სა და Request Body-ს შორის? (როდის რომელს ვიყენებთ?)
URL Params -ეს არის მონაცემი, რომელიც უშუალოდ URL-ის მისამართის (Gზის) ნაწილია. ის გამოიყენება კონკრეტული რესურსის იდენტიფიცირებისთვის.
მაგალითი: http://localhost:3000/products/1

1 არის URL Param.

Query Params -ეს არის მონაცემები, რომლებიც ემატება URL-ის ბოლოს ? ნიშნის შემდეგ და გამოყოფილია &-ით (key=value ფორმატით). ის გამოიყენება მონაცემების ფილტრაციისთვის, სორტირებისთვის ან პაგინაციისთვის (გვერდებად დაყოფისთვის).
მაგალითი: http://localhost:3000/products?page=1&take=2

2.4. რა არის Middleware Express.js-ში/NestJS-ში და რაში გამოიყენება ის?

Middleware (შუალედური პროგრამული უზრუნველყოფა) არის ფუნქცია, რომელიც ექცევა კლიენტის მოთხოვნასა (Request) და სერვერის პასუხს (Response) შორის.

როდესაც მომხმარებელი აგზავნის მოთხოვნას სერვერზე, სანამ ის მიაღწევს საბოლოო დანიშნულების ადგილს (მაგალითად, კონკრეტულ როუტს ან კონტროლერს), Middleware-ს შეუძლია ეს მოთხოვნა გადაიჭიროს, შეამოწმოს, შეცვალოს ან საერთოდ დაბლოკოს.

3.1. რა არის შრეობრივი არქიტექტურა (Layered Architecture) და რა პასუხისმგებლობები აქვთ:
     - Controller არის იგივე როუტინგი  რომელიც უზრუნველყობს კონკრეტული როუტების დაკავშირებას სერვისების ფუნქციებთან
     - Service - იწერაბა მთავარი ბიზენეს ლოგიკა
     - module - ერთ კონკრეტულ ფუნქციონალთან დაკავშირებული Controller-ების და Service-ების ერთ კონტეინერში შეკრება 
     ასევე აქ შეგვიძლია დავაკავშიროთ ბაზასთან
// 3.3. რა არის Dependency Injection (DI) ?
Dependency Injection (DI) — არის პროგრამირების დიზაინის შაბლონი (Design Pattern), რომელიც გამოიყენება ობიექტებს შორის დამოკიდებულებების (Dependencies) შემცირებისა და მართვისთვის (Loose Coupling).

მარტივად რომ ვთქვათ ობიექტი თვითონ კი არ ქმნის იმ ინსტრუმენტებს, რომლებიც სჭირდება, არამედ იღებს მათ გარედან

// 3.4. რა არის DTO (Data Transfer Object) და რატომ ვიყენებთ მას Validation Pipe-ებთან ერთად?
DTO (Data Transfer Object) არის დიზაინ-პატერნი (Design Pattern), რომელიც გამოიყენება აპლიკაციის სერვერსა და კლიენტს (ან სერვისის სხვადასხვა ფენებს) შორის მონაცემების გადასაცემად.

DTO არის უბრალო ობიექტი (Plain Object / TypeScript Class), რომელსაც არ გააჩნია ბიზნეს-ლოგიკა. მისი ერთადერთი დანიშნულებაა მკაფიოდ განსაზღვროს, თუ რა სტრუქტურის მონაცემები უნდა შემოვიდეს მოთხოვნაში (Request) ან გავიდეს პასუხში (Response).
